In [30]:
import pandas as pd
import math

In [50]:
df = pd.read_csv("file:/home/jvanover/Documents/ucd/271/programming-assignments/recommendation-system/data/train.csv")
df.sort_values(by=['customer-id'], inplace=True)

In [54]:
eval_size_per_cid = df['customer-id'].value_counts().apply(lambda x: math.floor(x/10)).to_dict()
eval_size_per_mid = df['movie-id'].value_counts().apply(lambda x: math.floor(x/10)).to_dict()

In [39]:
my_train = []
my_eval = []
for index, row in df.iterrows():
    if eval_size_per_cid[row["customer-id"]] != 0:
        my_eval.append(row)
        eval_size_per_cid[row["customer-id"]] -= 1
    else:
        my_train.append(row)

In [40]:
df_my_train = pd.DataFrame(my_train)

In [48]:
df_my_train["movie-id"].nunique()

15887

In [42]:
df_my_eval = pd.DataFrame(my_eval)

In [46]:
df_my_eval

        movie-id  customer-id  rating        date
701392     12918            6       5  2004-09-22
757690      7643            6       3  2004-12-14
318660       329            6       4  2004-09-15
893542      8743            6       4  2005-11-25
394292      7509            6       3  2005-12-04
...          ...          ...     ...         ...
422812     11149        33182       3  2005-07-01
884145      3427        33182       3  2005-07-01
389803     12476        33182       2  2005-07-01
872076       334        33182       3  2005-07-19
661294      6196        33182       5  2005-07-01

[97375 rows x 4 columns]

In [47]:
97375/ (902625)

0.10787979504223792